#include <list>
#include <vector>
#include <string.h>
#include <pthread.h>
#include <thread>
#include <cstring>
#include <jni.h>
#include <unistd.h>
#include <fstream>
#include <iostream>
#include <dlfcn.h>
#include "Includes/Logger.h"
#include "Includes/obfuscate.h"
#include "Includes/Utils.h"
#include "KittyMemory/MemoryPatch.h"
#include "Menu/Setup.h"
#include "Includes/Esp.h"
#include "Includes/Hook.h"

//Target lib here
#define targetLibName OBFUSCATE("libil2cpp.so")
#define targetLibName1 OBFUSCATE("libunity.so")

#include "Includes/Macros.h"
#define HOOK(offset, ptr, orig) MSHookFunction((void *)getRealOffset(offset), (void *)ptr, (void **)&orig)



// Do not change or translate the first text unless you know what you are doing
// Assigning feature numbers is optional. Without it, it will automatically count for you, starting from 0
// Assigned feature numbers can be like any numbers 1,3,200,10... instead in order 0,1,2,3,4,5...
// ButtonLink, Category, RichTextView and RichWebView is not counted. They can't have feature number assigned
// Toggle, ButtonOnOff and Checkbox can be switched on by default, if you add True_. Example: CheckBox_True_The Check Box
// To learn HTML, go to this page: https://www.w3schools.com/

jobjectArray GetFeatureList(JNIEnv *env, jobject context) {
    jobjectArray ret;

    const char *features[] = {
             OBFUSCATE("Category_FUNÇÕES"),//0 //Not counted
             OBFUSCATE("ButtonLink_ATUALIZAÇÃO _https://bityli.com/IEblP"),//1
             OBFUSCATE("Category_Menu Aim"),//2 //Not counted
             OBFUSCATE("Toggle_AimBot"),//3
             OBFUSCATE("Toggle_AimBot Auto"),//4
             OBFUSCATE("Toggle_AimBot Tiro"),//5
             OBFUSCATE("Toggle_AimBot Mira"),//6
             OBFUSCATE("Toggle_AimBot Agachado"),//7
             OBFUSCATE("Toggle_AimBot Iginorar"),//8
             OBFUSCATE("Toggle_AimBot Ivisivel"),//9
             OBFUSCATE("SeekBar_AimFov_0_360"),//10
             OBFUSCATE("Category_Menu Esps"),//11 //Not counted
             OBFUSCATE("Toggle_Esp Raio"),//12
             OBFUSCATE("Toggle_Esp Draw"),//13
             OBFUSCATE("Toggle_Esp Nome"),//14
             OBFUSCATE("Toggle_Esp Fire"),//15
             OBFUSCATE("Toggle_Esp Distancia"),//16
             OBFUSCATE("Category_Menu Mapa"),//17 //Not counted
             OBFUSCATE("Toggle_Zé Pedrinha"),//18
             OBFUSCATE("Toggle_Teleporte Inimigo"),//19
             OBFUSCATE("Toggle_Gosth Hack"),//20
             OBFUSCATE("Toggle_Fly Hack"),//21
             OBFUSCATE("Toggle_Remover Paraquedas"),//22
             OBFUSCATE("Category_Menu Arma"),//23 //Not counted
             OBFUSCATE("Toggle_Recarga Rapida"),//24
             OBFUSCATE("SeekBar_Chuva De Balas_0_30"),//25
             OBFUSCATE("Toggle_Sem Mira"),//26
             OBFUSCATE("Toggle_Mira Branca"),//27
             OBFUSCATE("Toggle_Sem Som Arma"),//28
             OBFUSCATE("Toggle_Linha Arma"),//29

            OBFUSCATE("RichTextView_ESPEREM AS ATUALIZAÇÕES"
                      "<u> SE INSCREVAM </u>"
                      "<br /> NO CANAL <font color='red'>HACKUDO GAMER</font>"),
            OBFUSCATE("RichWebView_<html><head><style>body{color: white;}</style></head><body>"
                      "<marquee style=\"color: green; font-weight:bold;\" direction=\"left\" scrollamount=\"5\" behavior=\"scroll\">"
                      " A GARENA VAI PIRAR COM ESTE MOD GRÁTIS</marquee>"
                     "</body></html>"),
    };

    //Now you dont have to manually update the number everytime;
    int Total_Feature = (sizeof features / sizeof features[0]);
    ret = (jobjectArray)
            env->NewObjectArray(Total_Feature, env->FindClass(OBFUSCATE("java/lang/String")),
                                env->NewStringUTF(""));

    for (int i = 0; i < Total_Feature; i++)
        env->SetObjectArrayElement(ret, i, env->NewStringUTF(features[i]));

    return (ret);
}

struct My_Patches {
///novas funcoes
    MemoryPatch FlyCarro;
    MemoryPatch TeleportCarro;
    MemoryPatch Speed;
    MemoryPatch Speed2x;
    MemoryPatch Speed3x;
    MemoryPatch Speed4x;
    MemoryPatch Speed5x;
    MemoryPatch speedx250;
    MemoryPatch Underground1;
    MemoryPatch Underground2;
    MemoryPatch Speedcarro1;
    MemoryPatch Speedcarro2;
    MemoryPatch Speedcarro3;
    MemoryPatch Speedcarro4;
    MemoryPatch Speedcarro5;
    MemoryPatch WallCarro;
    MemoryPatch ZePedrinha;


    MemoryPatch LluviaDeBalas1;//0
    MemoryPatch LluviaDeBalas2;//0
    MemoryPatch LluviaDeBalas3;//0
    MemoryPatch LluviaDeBalas4;//0
    MemoryPatch LluviaDeBalas5;//0
    MemoryPatch LluviaDeBalas6;//0
    MemoryPatch LluviaDeBalas7;//0
    MemoryPatch LluviaDeBalas8;//0
    MemoryPatch LluviaDeBalas9;//0
    MemoryPatch LluviaDeBalas10;//0
    MemoryPatch LluviaDeBalas11;//0
    MemoryPatch LluviaDeBalas12;//0
    MemoryPatch LluviaDeBalas13;//0
    MemoryPatch LluviaDeBalas14;//0
    MemoryPatch LluviaDeBalas15;//0
    MemoryPatch LluviaDeBalas16;//0
    MemoryPatch LluviaDeBalas17;//0
    MemoryPatch LluviaDeBalas18;//0
    MemoryPatch LluviaDeBalas19;//0
    MemoryPatch LluviaDeBalas20;//0
    MemoryPatch SilenciarDisparos;
    MemoryPatch RemoverMiras;//01
    MemoryPatch MunicionesIlimitadas;//02
    MemoryPatch VelocidadDeDisparo1;//03
    MemoryPatch VelocidadDeDisparo2;//03
    MemoryPatch VelocidadDeDisparo3;//03
    MemoryPatch RecargaRapida;//04
    MemoryPatch CambioRapidoDeArma;//05
    MemoryPatch ReducirLag;//07
    MemoryPatch DisparosEnMovimiento;//08
    MemoryPatch DisparosAutomaticos;//09
    MemoryPatch TeletransportarCarro1;//10
    MemoryPatch TeletransportarCarro2;//10
    MemoryPatch MatarATodosEnElLobby;//11
    MemoryPatch ModoFantasma;//12
    MemoryPatch FantasmaVeloz1;//13
    MemoryPatch FantasmaVeloz2;//13
    MemoryPatch VelocidadDeCorrer1;//14
    MemoryPatch VelocidadDeCorrer2;//14
    MemoryPatch VelocidadDeCorrer3;//14
    MemoryPatch VelocidadDeCorrer4;//14
    MemoryPatch VelocidadDeCorrer5;//14
    MemoryPatch CuerposBlancos1;//15
    MemoryPatch CuerposBlancos2;//15
    MemoryPatch ModificarCuerpoDeEnemigos1;//16
    MemoryPatch ModificarCuerpoDeEnemigos2;//16
    MemoryPatch ModificarCuerpoDeEnemigos3;//16
    MemoryPatch SensibilidadBaja;
    MemoryPatch SensibilidadMedia;
    MemoryPatch SensibilidadAlta;
    MemoryPatch EnPrimeraPersona;//17
    MemoryPatch MedikitCorriendo1;//18
    MemoryPatch MedikitCorriendo2;//18
    MemoryPatch ModoNoche;//19
    MemoryPatch MapaNegro;//20
    MemoryPatch MapaBlanco;
    MemoryPatch TranspasarPiedras;//21
    MemoryPatch CarroTranspasaParedes1;//22
    MemoryPatch CarroTranspasaParedes2;//23
    MemoryPatch EliminarArboles;//24
    MemoryPatch ElimimarGrama;//25
    MemoryPatch ModoFullHd;//26
    MemoryPatch AmpliarVista1;//27
    MemoryPatch AmpliarVista2;//28
    MemoryPatch AmpliarVista3;//29
    MemoryPatch AmpliarVista4;
    MemoryPatch AmpliarVista5;
    MemoryPatch AmpliarVista6;
    MemoryPatch CaerEn360;//30
    MemoryPatch DiamantesInfinitos;//31
    MemoryPatch OroInfinito;//32
    MemoryPatch LikesInfinitos;//33
    MemoryPatch SerHeroico;//34
    MemoryPatch PrimeiraPessoa;//35
    MemoryPatch AntLogs;//36

    //(desatualizados)))

} hexlibPatches;


bool KMHack1 = false,
        KMHack2 = false,
        KMHack3 = false,
        KMHack4 = false,
        KMHack5 = false,
        KMHack6 = false,
        KMHack7 = false,
        KMHack8 = false,
        KMHack9 = false,
        KMHack10 = false,
        KMHack11 = false,
        KMHack12 = false,
        KMHack13 = false,
        KMHack14 = false,
        KMHack15 = false,
        KMHack16 = false,
        KMHack17 = false,
        KMHack18 = false,
        KMHack19 = false,
        KMHack20 = false,
        KMHack21 = false;

int Desativer = 0;

struct {

    float Fov_Aim = 0.998f;
    int semihs = 0;
    bool aimBotFov = false;
    bool aimScope = false;
    bool aimTiro = false;
    bool hs100 = false;
    bool ghost = false;
    bool hs70 = false;
    bool aimAgachado = false;
    bool aimBody = false;
    bool aimbotauto = true;
    bool teleKill = false;
    bool Paraquedas = false;
